wegam/STM32F1xWorkSpace/Examples/WOW/AMP_CABV11.C
  if((CabAddr!=address))  //不属于主柜消息
  {
    
    Cabinet_Send((unsigned char*)ampframe,framlength);//往副柜发送
    if(0xFF==address) //广播地址
    {
      
      AMPPro.buffer.WaitAck.Cab=0;   //不需要副柜应答      
    }
    else
    {
      //ackFrame(Port,1);             //向上应答
      AMPPro.buffer.WaitAck.Cab=1;  //需要副柜应答
      return;       //其它柜数据，退出
    }
  }
  //===================================接收到的数据为本柜可接收数据(本柜地址或者广播地址(0xFF))
  //1)-----------------检查层地址，判断是否需要将数据发往层，发往层时，需要开锁，开背光灯
  address=ampframe->msg.addr.address2;
  if(0!=address)
  {
    if(ampframe->msg.data[0]||ampframe->msg.data[1]||ampframe->msg.data[2])   //点亮指引灯，需要开背光和锁
    {
      AMPPro.Req.unlockqust=1;//请求开锁
      AMPPro.Req.reslock=0;
      AMPPro.Req.BLon=1;
      AMPPro.Req.BLoff=0;
      AMPPro.Req.PLon=1; 
      AMPPro.Req.PLoff=0; 
    }
    if(0xFF==address)//广播地址
    {
      AMPPro.buffer.WaitAck.Lay=0;   //不需要应答
    }
    else
    {
      AMPPro.buffer.WaitAck.Lay=1;   //需要应答
    }    
    Laynet_Send((unsigned char*)ampframe,framlength);     //往层板发送消息
    return;     //任务完成，退出
  }
  //2)-----------------层地址为0，不需要往下发，只在柜控制板处理：灯控制/锁控制/供电
  if(AmpCmdLed ==  Cmd)   //背光控制命令
  {
    AMPPro.Req.BLon=0;
    AMPPro.Req.BLoff=0;
    if(ampframe->msg.data[0])
      AMPPro.Req.BLon=1;
    else
      AMPPro.Req.BLoff=1;
  }
  else if(AmpCmdPwr ==  Cmd)   //层板供电控制命令
  {
    AMPPro.Req.PLon  =0;
    AMPPro.Req.PLoff =0;
    if(ampframe->msg.data[0])
      AMPPro.Req.PLon=1;
    else
      AMPPro.Req.PLoff=1;
  }
  else if(AmpCmdLock ==  Cmd)   //锁控制命令
  {
    AMPPro.Req.reslock  =0;
    AMPPro.Req.unlockqust =0;
    if(ampframe->msg.data[0])
      AMPPro.Req.unlockqust=1;
    else
      AMPPro.Req.reslock=1;
  }
}
/*******************************************************************************
* 函数名			:	Cabinetmsg_Process
* 功能描述		:	柜消息处理：处理上位机下发消息，处理主柜下发消息，处理层板消息 
* 输入			: void
* 返回值			: void
* 修改时间		: 无
* 修改内容		: 无
* 其它			: wegam@sina.com
*******************************************************************************/
void Msg_ProcessCbPort(enCCPortDef Port,unsigned char* pBuffer,unsigned short length)
{  
  unsigned  char result       = 0; 
  unsigned  char address      = 0;  
  unsigned  short framlength  = 0; 
  unsigned  char  Cmd         = 0;  
  unsigned  char* paddrbac    = pBuffer;         //备份数据缓存起始地址
  
  stampphydef* ampframe=NULL;
  //-------------------------检查端口是否为层接口及缓存地址是否为空
  if(CabPort!=Port||NULL==pBuffer)
  {
    return;
  } 
  //-------------------------协议检查
  framlength	=	getframe(pBuffer,&length);    //判断帧消息内容是否符合协议
  if(0== framlength)
  {
    memset(paddrbac,0x00,gDatasize);             //清除数据
    return;
  }
  result  = ackcheck(pBuffer);                //检查是否为应答消息,应答消息返回1  
  if(1==result)
  {
    if(AMPPro.buffer.WaitAck.Cab)           //如果为等待应答状态，则释放一个缓存
    {
      AMPPro.buffer.WaitAck.Cab=0;
      Releas_OneBuffer(Port);               //释放一个发送缓存
    }
    return;
  }  
  //-------------------------根据地址转发数据：广播数据发送到副柜和本柜层板
  ampframe  = (stampphydef*)pBuffer;
  Cmd = ampframe->msg.cmd.cmd;  
  
  //-------------------------上传数据:柜接口
  //主柜：接收到的数据上传到PC并向下应答
  //副柜：接收到下发数据判断地址,如果地址为本地址，向上应答(广播地址不应答)，如果是上传数据，不处理
  //1）-----------------上传数据:PC接口只接收下发数据
  if(ampframe->msg.cmd.dir)   //0-down,1-up---高8位
  {
    if(MainFlag)    //0--副柜，1--主柜
    {
      ackFrame(Port,0); //向下应答---主柜应答副柜
      AMPPro.buffer.WaitAck.Pc=1;   //需要PC应答
      PCnet_Send((unsigned char*)ampframe,framlength);      //往PC发送消息
    }
    return;   //任务完成
  }
  //2）-----------------下发数据：地址为本地址或者广播地址(0xFF)需要进行处理，如果地址为本地址，向上应答(广播地址不应答)
  address=ampframe->msg.addr.address1;
  if(0==address)      //柜地址为空
  {
    return;
  }
  if((CabAddr!=address)&&(0xFF!=address))  //不属于此柜消息
  {
    return;
  }
  if(CabAddr==address)
    ackFrame(Port,1);             //向上应答
  //===================================接收到的数据为本柜可接收数据(本柜地址或者广播地址(0xFF))
  //1)-----------------检查层地址，判断是否需要将数据发往层，发往层时，需要开锁，开背光灯
  address=ampframe->msg.addr.address2;
  if(0!=address)
  {
    if(ampframe->msg.data[0]||ampframe->msg.data[1]||ampframe->msg.data[2])   //点亮指引灯，需要开背光和锁
    {
      AMPPro.Req.unlockqust=1;//请求开锁
      AMPPro.Req.reslock=0;
      AMPPro.Req.BLon=1;
      AMPPro.Req.BLoff=0;
      AMPPro.Req.PLon=1; 
      AMPPro.Req.PLoff=0; 
    }    
    if(0xFF==address)//广播地址
    {
      AMPPro.buffer.WaitAck.Lay=0;   //不需要应答
    }
    else
    {
      AMPPro.buffer.WaitAck.Lay=1;   //需要应答
    }
    Laynet_Send((unsigned char*)ampframe,framlength);     //往层板发送消息
    return;     //任务完成，退出
  }
  //2)-----------------层地址为0，不需要往下发，只在柜控制板处理：灯控制/锁控制/供电
  if(AmpCmdLed ==  Cmd)   //背光控制命令
  {
    AMPPro.Req.BLon=0;
    AMPPro.Req.BLoff=0;
    if(ampframe->msg.data[0])
      AMPPro.Req.BLon=1;
    else
      AMPPro.Req.BLoff=1;
  }
  else if(AmpCmdPwr ==  Cmd)   //层板供电控制命令
  {
    AMPPro.Req.PLon  =0;
    AMPPro.Req.PLoff =0;
    if(ampframe->msg.data[0])
      AMPPro.Req.PLon=1;
    else
      AMPPro.Req.PLoff=1;
  }
  else if(AmpCmdLock ==  Cmd)   //锁控制命令
  {
    AMPPro.Req.reslock  =0;
    AMPPro.Req.unlockqust =0;
    if(ampframe->msg.data[0])
      AMPPro.Req.unlockqust=1;
    else
      AMPPro.Req.reslock=1;
  }
  else if(AmpCmdGetOnline ==  Cmd)   //获取在线设备：前面语句有应答，此处不处理
  {
    return;
  }
}
/*******************************************************************************
* 函数名			:	Cabinetmsg_Process
* 功能描述		:	柜消息处理：处理上位机下发消息，处理主柜下发消息，处理层板消息 
* 输入			: void
* 返回值			: void
* 修改时间		: 无
* 修改内容		: 无
* 其它			: wegam@sina.com
*******************************************************************************/
void Msg_ProcessCaPort(enCCPortDef Port,unsigned char* pBuffer,unsigned short length)
{  
  CardDataSendUp(Port,pBuffer,length);
}
/*******************************************************************************
* 函数名			:	Cabinetmsg_Process
* 功能描述		:	柜消息处理：处理上位机下发消息，处理主柜下发消息，处理层板消息 
* 输入			: void
* 返回值			: void
* 修改时间		: 无
* 修改内容		: 无
* 其它			: wegam@sina.com
*******************************************************************************/
void Msg_ProcessLyPort(enCCPortDef Port,unsigned char* pBuffer,unsigned short length)
{  
  unsigned  char result       = 0; 
  //unsigned  char address      = 0;  
  unsigned  short framlength  = 0; 
  //unsigned  char  Cmd         = 0;  
  unsigned  char* paddrbac    = pBuffer;         //备份数据缓存起始地址
  
  stampphydef* ampframe=NULL;
  
  framlength=length;
  
  //-------------------------协议检查
  framlength	=	getframe(paddrbac,&framlength);    //判断帧消息内容是否符合协议
  if(0== framlength)    //不符合协议，做透传---读卡器
  {
//    CardDataSendUp(Port,pBuffer,length);
    return;
  }
  
