wegam/STM32F1xWorkSpace/Examples/WOW/AMP_CABV11.C
  pBuffer=paddrbac;  
  result  = ackcheck(pBuffer);                //检查是否为应答消息,应答消息返回1  
  if(1==result)
  {
    if(AMPPro.buffer.WaitAck.Lay)      //如果为等待应答状态，则释放一个缓存
    {
      AMPPro.buffer.WaitAck.Lay=0;
      Releas_OneBuffer(Port);        //释放一个发送缓存
    }
    return;
  }  
  //-------------------------根据地址转发数据：广播数据发送到副柜和本柜层板
  ampframe  = (stampphydef*)pBuffer;
  //Cmd = ampframe->msg.cmd.cmd;
  
  //-------------------------处理说明：柜板--LyPort口根据方向判断为层板还是柜板，柜板下发，层板上传
  //-------------------------上传数据:柜接口
  //柜板：接收的数据方向为上传，应答或者数据，不符合协议的内容则透传
  //层板：接收到的数据为下发数据，应答或者命令，不符合协议的内容不处理
  //1）-----------------上传数据:柜接收的数据为上传数据，如果不是应答，则需要加上柜地址，再打包通过柜/PC接口上传
  if(1==ampframe->msg.cmd.dir)
  {
    unsigned  char  databuffer[64]={0};
    
    ackFrame(Port,0); //向下应答    
       
    //-------------------------读卡器端口接收到数据
    memcpy(databuffer,pBuffer,length);
    framlength  = length;
    framlength  = PaketUpMsg(databuffer,AmpCmdCard,&framlength);
    //-------------------------设置地址:柜控制板地址段为address1
    ampframe  = (stampphydef*)databuffer;
    ampframe->msg.addr.address1 = CabAddr;
    //-------------------------设置CRC和结束符
    SetFrame(databuffer,&framlength);   //补充消息的CRC和结束符，返回帧长度
    //-------------------------检查本柜是否为主柜
    if(1==MainFlag)   //主柜--通过PC接口上传
    {
      AMPPro.buffer.WaitAck.Pc=1;   //需要应答
      PCnet_Send(databuffer,framlength);
    }
    else  //副柜--通过副柜接口上传
    {
      AMPPro.buffer.WaitAck.Cab=1;   //需要应答
      Cabinet_Send(databuffer,framlength);     //往副柜发送消息
    }    
    return;
  }
  //2）-----------------下发数据：只有层板会接收下发数据
  else
  {
    return;
  }
}
/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
void CardDataSendUp(enCCPortDef Port,unsigned char* pBuffer,unsigned short length)
{
  //unsigned  char result       = 0; 
  //unsigned  char address      = 0;  
  unsigned  short framlength  = 0;  
  //unsigned  char* paddrbac    = pBuffer;         //备份数据缓存起始地址
  
  stampphydef* ampframe=NULL;
  //stcmddef    Cmd;
  
  unsigned  char  databuffer[64]={0};   
  //-------------------------读卡器端口接收到数据
  memcpy(databuffer,pBuffer,length);
  framlength  = length;
  framlength  = PaketUpMsg(databuffer,AmpCmdCard,&framlength);
  
  //-------------------------设置地址:柜控制板地址段为address1
  ampframe  = (stampphydef*)databuffer;
  ampframe->msg.addr.address1 = CabAddr;    //柜地址
  ampframe->msg.addr.address2 = 0;
  ampframe->msg.addr.address3 = 0;
  //-------------------------设置CRC和结束符
  SetFrame(databuffer,&framlength);//补充消息的CRC和结束符，返回帧长度
  
  if(MainFlag)  //0--副柜，1--主柜
  {
    AMPPro.buffer.WaitAck.Pc=1;   //需要应答
    PCnet_Send(databuffer,framlength);    //往副柜发送消息
  }
  else
  {
    AMPPro.buffer.WaitAck.Cab=1;   //需要应答
    Cabinet_Send(databuffer,framlength);    //往副柜发送消息
  }
  return;
}
/*******************************************************************************
*函数名			:	RequestServer
*功能描述		:	请求命令处理
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
void RequestServer(void)
{    
    if(AMPPro.Req.PLon)    //层板供电控制
    {      
      LayPowerOn;
      AMPPro.Req.PLon=0;
      AMPPro.Flag.LayPownOn=1;
    }
    else if(AMPPro.Req.PLoff)
    {
      LayPowerOff;
      AMPPro.Req.PLoff=0;
      AMPPro.Flag.LayPownOn=0;
    }
    //if(AMP.Req.unlockqust)
    //{      
      //LockServer();
    //}
    //LockServer();
}
/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
void StatusServer(void)
{
  static unsigned long statustemp=0;
  unsigned short* ptemp=0;
  ptemp=(unsigned short*)&AMPPro.Sta;
  if(statustemp!=*ptemp)//状态有变化
  {
    unsigned short framlength=3;
    unsigned char databuffer[32]={0};
    
    stampphydef* ampframe=NULL;
    //stcmddef*   Cmd=NULL;
    
    statustemp=*ptemp;
    

    memcpy(databuffer,ptemp,2);
    
    framlength  = PaketUpMsg(databuffer,AmpCmdSta,&framlength);    
    ampframe  = (stampphydef*)databuffer;
    
    ampframe->msg.addr.address1 = CabAddr;
    ampframe->msg.addr.address2 = 0;
    ampframe->msg.addr.address3 = 0;
    //-------------------------设置CRC和结束符
    SetFrame(databuffer,&framlength);//补充消息的CRC和结束符，返回帧长度
    if(MainFlag)  //0--副柜，1--主柜
    {
      AMPPro.buffer.WaitAck.Pc=1;   //需要应答
      PCnet_Send(databuffer,framlength);    //往副柜发送消息
    }
    else
    {
      AMPPro.buffer.WaitAck.Cab=1;   //需要应答
      Cabinet_Send(databuffer,framlength);    //往副柜发送消息
    }
  }
}
